vlm/extension/Documents/ЗаданиеНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаданиеНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Паспорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПриобретениеУслугПеревозки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_КоличествоМестИтого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Оплата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПунктов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаПланС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВремяРейсаФактПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КурьерЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаданиеВыполняет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИсполнителейЗаданийНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Маршрут</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Зона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Enums/СтатусыРасходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыРасходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/РасходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасходныйОрдерНаТовары</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварыПоРаспоряжениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Распоряжение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.РаспоряжениеНаОтгрузку</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Documents/ЗаданиеНаПеревозку/Forms/ФормаПодбораРаспоряжений/Ext/Form/Module.bsl
&НаСервере
Процедура бит_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 9:41:34] +
	бит_СоздатьКолонкуКоличествоМест(); 
	бит_Дерево = РеквизитФормыВЗначение("РаспоряженияНаДоставку");
	бит_ЗаполнитьКолонкуКоличествоМест(бит_Дерево); 
	ЗначениеВРеквизитФормы(бит_Дерево,"РаспоряженияНаДоставку");
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 9:41:36] -
КонецПроцедуры

&НаСервере
Процедура бит_СоздатьКолонкуКоличествоМест()
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 10:14:28] +	
	бит_Дерево = РеквизитФормыВЗначение("РаспоряженияНаДоставку");      
	Если бит_Дерево.Колонки.Найти("бит_КоличествоМест") = Неопределено Тогда
		МассивДобавляемыхРеквизитов = Новый Массив;  
		КЧ = Новый КвалификаторыЧисла(5,0);
		ТипРеквизитаЧисло = Новый ОписаниеТипов("Число",,,КЧ);
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("бит_КоличествоМест", ТипРеквизитаЧисло, "РаспоряженияНаДоставку", "(бит) Количество мест", Истина));
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);	
		
		НовыйЭлемент = Элементы.Вставить("бит_КоличествоМест", Тип("ПолеФормы"), Элементы.РаспоряженияНаДоставку, Элементы.РаспоряженияНаДоставкуСклад);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "РаспоряженияНаДоставку.бит_КоличествоМест";
	КонецЕсли;
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 10:14:31] -	
КонецПроцедуры      

&НаСервере
Процедура бит_ЗаполнитьКолонкуКоличествоМест(бит_Дерево, бит_КоличествоМест = 0)
    // {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 10:22:02] +
	Для каждого СтрокаДЗ Из бит_Дерево.Строки Цикл 
		СтрокаДЗ.бит_КоличествоМест = бит_ПолучитьКоличествоМест(СтрокаДЗ.Распоряжение); 
		Если СтрокаДЗ.Строки.Количество() > 0 Тогда
			бит_ЗаполнитьКолонкуКоличествоМест(СтрокаДЗ, СтрокаДЗ.бит_КоличествоМест);	
		КонецЕсли;
	КонецЦикла;	
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 10:22:04] -
КонецПроцедуры  

&НаСервере
&После("ОбновитьСписокРаспоряженийНаДоставку")
Процедура бит_ОбновитьСписокРаспоряженийНаДоставку()
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 9:41:34] +
	бит_СоздатьКолонкуКоличествоМест();  
	бит_Дерево = РеквизитФормыВЗначение("РаспоряженияНаДоставку");
	бит_ЗаполнитьКолонкуКоличествоМест(бит_Дерево); 
	ЗначениеВРеквизитФормы(бит_Дерево,"РаспоряженияНаДоставку");
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 9:41:36] -
КонецПроцедуры

&НаСервере
Функция бит_ПолучитьКоличествоМест(бит_Распоряжение)
// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 13:49:35] +	

	Если ТипЗнч(бит_Распоряжение) = Тип("ДокументСсылка.ПоручениеЭкспедитору") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.бит_КоличествоМест) КАК бит_КоличествоМест
		|ИЗ
		|	Документ.ПоручениеЭкспедитору.Основания КАК ПоручениеЭкспедиторуОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|		ПО ПоручениеЭкспедиторуОснования.Основание = РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
		|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)
		|	И ПоручениеЭкспедиторуОснования.Ссылка = &Распоряжение";
		
		Запрос.УстановитьПараметр("Распоряжение", бит_Распоряжение);
	
	ИначеЕсли ТипЗнч(бит_Распоряжение) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.бит_КоличествоМест) КАК бит_КоличествоМест
		|ИЗ
		|	Документ.РасходныйОрдерНаТовары.ТоварыПоРаспоряжениям КАК РасходныйОрдерНаТоварыТоварыПоРаспоряжениям
		|ГДЕ
		|	РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Распоряжение = &Распоряжение
		|	И РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Проведен = ИСТИНА
		|	И НЕ РасходныйОрдерНаТоварыТоварыПоРаспоряжениям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРасходныхОрдеров.Отгружен)";
		
		Запрос.УстановитьПараметр("Распоряжение", бит_Распоряжение);
	Иначе
		Возврат 0;
	КонецЕсли;
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.бит_КоличествоМест;
	КонецЦикла;
	
// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 13:49:38] -
КонецФункции

&НаСервере
&ИзменениеИКонтроль("СохранитьРезультаты")
Функция бит_СохранитьРезультаты()

	Товары = ДоставкаТоваров.СкопироватьКолонкиКоллекции(ТоварыРаспоряженийКДоставке,
	"Распоряжение,Склад,ПолучательОтправитель,Номенклатура,Характеристика,Назначение,Серия,Количество,ВсеТовары");
	#Вставка
	// {{ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 15:33:42] +
	Распоряжения = ДоставкаТоваров.СкопироватьКолонкиКоллекции(РаспоряженияНаДоставку,
	"Распоряжение,Склад,Вес,Объем,ВремяС,ВремяПо,ПолучательОтправитель,Перевозчик,ДополнительнаяИнформация,
	|Зона,Адрес,АдресЗначенияПолей,бит_КоличествоМест");		
	// }}ПервыйБИТ ЛистТребовани [ЛТ 2.4] [AVZhelansky@1cbit.ru] [05.06.2025 15:33:43] -
	#КонецВставки
	#Удаление	
	Распоряжения = ДоставкаТоваров.СкопироватьКолонкиКоллекции(РаспоряженияНаДоставку,
	"Распоряжение,Склад,Вес,Объем,ВремяС,ВремяПо,ПолучательОтправитель,Перевозчик,ДополнительнаяИнформация,
	|Зона,Адрес,АдресЗначенияПолей");
	#КонецУдаления
	
	СтруктураПоиска = Новый Структура("ИдентификаторВДеревеРаспоряжений", 0);
	ВыделенныеСтроки = Элементы.РаспоряженияНаДоставку.ВыделенныеСтроки;
	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл // Число

		СтруктураПоиска.ИдентификаторВДеревеРаспоряжений = Идентификатор;
		СтрокаРаспоряжение = Распоряжения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРаспоряжение, РаспоряженияНаДоставку.НайтиПоИдентификатору(Идентификатор));
		НайденныеСтрокиТоваров = ТоварыРаспоряженийКДоставке.НайтиСтроки(СтруктураПоиска);
		Для Каждого Стр Из НайденныеСтрокиТоваров Цикл
			ЗаполнитьЗначенияСвойств(Товары.Добавить(), Стр);
		КонецЦикла;

	КонецЦикла;

	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("АдресРаспоряжений", ПоместитьВоВременноеХранилище(Распоряжения, ГуидВладельца));
	СтруктураВозврата.Вставить("АдресТоваров", ПоместитьВоВременноеХранилище(Товары, ГуидВладельца));
	Возврат СтруктураВозврата;

КонецФункции
